app/Controllers/BangLuongController.php

SELECT *
FROM `nhan_vien`
SELECT *
FROM `ky_luong`
---
    public function create()
    {
        $nhanVienModel = new NhanVienModel();
        $kyLuongModel = new KyLuongModel();

        $data['nhanviens'] = $nhanVienModel->findAll();
        $data['kyluongs'] = $kyLuongModel->findAll();