app/Controllers/ChamCongController.php


        $model = new ChamCongModel();

        $model->save([
            'nhan_vien_id' => $this->request->getPost('nhan_vien_id'),

            'ca_lam_id' =>$this->request->getPost('ca_lam_id'),

            'ngay_cham_cong' =>$this->request->getPost('ngay_cham_cong'),

            'check_in' =>$this->request->getPost('check_in'),

            'check_out' =>$this->request->getPost('check_out'),

            'trang_thai' =>$this->request->getPost('trang_thai'),

            'ghi_chu' =>$this->request->getPost('ghi_chu')
        ]);
---
INSERT INTO `cham_cong` (`nhan_vien_id`, `ca_lam_id`, `ngay_cham_cong`, `check_in`, `check_out`, `trang_thai`, `ghi_chu`) VALUES ('4', '1', '2026-06-03', NULL, NULL, 'PRESENT', '')