app/Controllers/DashboardController.php

    public function index()
    {
        $nhanVienModel = new NhanVienModel();
        $phongBanModel = new PhongBanModel();
        $taiKhoanModel = new TaiKhoanModel();
        $bangLuongModel = new BangLuongModel();
        $nghiPhepModel = new DonNghiPhepModel();

        $data = [];
            $data['tongNhanVien'] = $nhanVienModel->countAll();
            $data['tongPhongBan'] = $phongBanModel->countAll();

            $tongLuong = $bangLuongModel
                ->selectSum('luong_thuc_nhan')
                ->first();

            $data['tongLuong'] = $tongLuong['luong_thuc_nhan'] ?? 0;

            $data['tongTaiKhoan'] = $taiKhoanModel->countAll();

            $data['tongActive'] = $nhanVienModel
                ->where('trang_thai', 'ACTIVE')
                ->countAllResults();

            $data['tongInactive'] = $nhanVienModel
                ->where('trang_thai', 'INACTIVE')
                ->countAllResults();

            $data['nhanVienMoi'] = $nhanVienModel
                ->orderBy( 'nhan_vien_id', 'DESC')
                ->findAll(5);

            $data['donNghiMoi'] = $nghiPhepModel
                ->select('don_nghi_phep.*, nhan_vien.ho_ten')
                ->join('nhan_vien', 'nhan_vien.nhan_vien_id = don_nghi_phep.nhan_vien_id')
                ->orderBy('don_nghi_phep_id', 'DESC')
                ->findAll(5);

            $phongBanStats = $nhanVienModel
                ->select('phong_ban.ten_phong_ban, COUNT(nhan_vien.nhan_vien_id)as tong')
                ->join('phong_ban','phong_ban.phong_ban_id = nhan_vien.phong_ban_id')
                ->groupBy('phong_ban.ten_phong_ban')
                ->findAll();
---
SELECT COUNT(*) AS `numrows` FROM `nhan_vien`
SELECT COUNT(*) AS `numrows` FROM `phong_ban`
SELECT SUM(`luong_thuc_nhan`) AS `luong_thuc_nhan`
FROM `bang_luong`
 LIMIT 1
SELECT COUNT(*) AS `numrows` FROM `tai_khoan`
SELECT COUNT(*) AS `numrows`
FROM `nhan_vien`
WHERE `trang_thai` = 'ACTIVE'
SELECT COUNT(*) AS `numrows`
FROM `nhan_vien`
WHERE `trang_thai` = 'INACTIVE'
SELECT *
FROM `nhan_vien`
ORDER BY `nhan_vien_id` DESC
 LIMIT 5
SELECT `don_nghi_phep`.*, `nhan_vien`.`ho_ten`
FROM `don_nghi_phep`
JOIN `nhan_vien` ON `nhan_vien`.`nhan_vien_id` = `don_nghi_phep`.`nhan_vien_id`
ORDER BY `don_nghi_phep_id` DESC
 LIMIT 5
SELECT `phong_ban`.`ten_phong_ban`, COUNT(nhan_vien.nhan_vien_id)as tong
FROM `nhan_vien`
JOIN `phong_ban` ON `phong_ban`.`phong_ban_id` = `nhan_vien`.`phong_ban_id`
GROUP BY `phong_ban`.`ten_phong_ban`