app/Models/BangLuongModel.php

    public function getAllBangLuong()
    {
        return $this
            ->select('bang_luong.*, nhan_vien.ho_ten, ky_luong.thang, ky_luong.nam')
            ->join('nhan_vien', 'nhan_vien.nhan_vien_id = bang_luong.nhan_vien_id')
            ->join('ky_luong', 'ky_luong.ky_luong_id = bang_luong.ky_luong_id')
            ->orderBy('bang_luong_id', 'DESC')
            ->findAll();
---
SELECT `bang_luong`.*, `nhan_vien`.`ho_ten`, `ky_luong`.`thang`, `ky_luong`.`nam`
FROM `bang_luong`
JOIN `nhan_vien` ON `nhan_vien`.`nhan_vien_id` = `bang_luong`.`nhan_vien_id`
JOIN `ky_luong` ON `ky_luong`.`ky_luong_id` = `bang_luong`.`ky_luong_id`
ORDER BY `bang_luong_id` DESC