app/Models/ChamCongModel.php

    public function getChamCongByNhanVien($nhanVienId)
    {
        return $this
            ->select('
                cham_cong.*,
                nhan_vien.ho_ten,
                nhan_vien.ma_nhan_vien,
                ca_lam.ten_ca
            ')
            ->join(
                'nhan_vien',
                'nhan_vien.nhan_vien_id = cham_cong.nhan_vien_id'
            )
            ->join(
                'ca_lam',
                'ca_lam.ca_lam_id = cham_cong.ca_lam_id'
            )
            ->where(
                'cham_cong.nhan_vien_id',
                $nhanVienId
            )
            ->orderBy('cham_cong_id', 'DESC')
            ->findAll();
---
SELECT `cham_cong`.*, `nhan_vien`.`ho_ten`, `nhan_vien`.`ma_nhan_vien`, `ca_lam`.`ten_ca`
FROM `cham_cong`
JOIN `nhan_vien` ON `nhan_vien`.`nhan_vien_id` = `cham_cong`.`nhan_vien_id`
JOIN `ca_lam` ON `ca_lam`.`ca_lam_id` = `cham_cong`.`ca_lam_id`
WHERE `cham_cong`.`nhan_vien_id` = '2'
ORDER BY `cham_cong_id` DESC