app/Models/NhanVienModel.php

SELECT `nhan_vien`.*, `phong_ban`.`ten_phong_ban`, `vai_tro`.`ten_vai_tro`
FROM `nhan_vien`
LEFT JOIN `phong_ban` ON `phong_ban`.`phong_ban_id` = `nhan_vien`.`phong_ban_id`
LEFT JOIN `vai_tro` ON `vai_tro`.`vai_tro_id` = `nhan_vien`.`vai_tro_id`
ORDER BY `nhan_vien_id` DESC
---
    public function getAllNhanVien()
    {
        return $this
            ->select('
                nhan_vien.*,
                phong_ban.ten_phong_ban,
                vai_tro.ten_vai_tro
            ')
            ->join(
                'phong_ban',
                'phong_ban.phong_ban_id = nhan_vien.phong_ban_id',
                'left'
            )
            ->join(
                'vai_tro',
                'vai_tro.vai_tro_id = nhan_vien.vai_tro_id',
                'left'
            )
            ->orderBy(
                'nhan_vien_id',
                'ASC'
            )
            ->findAll();