app/Models/PhongBanModel.php

    public function getAllPhongBan()
    {
        return $this

            ->select('
                phong_ban.*,
                COUNT(nhan_vien.nhan_vien_id)
                AS tong_nhan_vien
            ')

            ->join(
                'nhan_vien',
                'nhan_vien.phong_ban_id = phong_ban.phong_ban_id',
                'left'
            )

            ->groupBy(
                'phong_ban.phong_ban_id'
            )

            ->orderBy(
                'phong_ban.phong_ban_id',
                'DESC'
            )
            ->findAll();
---
SELECT `phong_ban`.*, COUNT(nhan_vien.nhan_vien_id)
                AS tong_nhan_vien
FROM `phong_ban`
LEFT JOIN `nhan_vien` ON `nhan_vien`.`phong_ban_id` = `phong_ban`.`phong_ban_id`
GROUP BY `phong_ban`.`phong_ban_id`
ORDER BY `phong_ban`.`phong_ban_id` DESC